Sistemas Distribuidos en C/BlackJack con SOAP/blackJack.playerMove.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:blackJackns="urn:blackJackns">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <blackJackns:playerMove>
   <playerName>
    <msg></msg>
   </playerName>
   <playerMove>0</playerMove>
   <idPartida>0</idPartida>
  </blackJackns:playerMove>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
